Revit 2027 API
ParameterTypeId.DimLeaderShoulderLength Property
 "Shoulder Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimLeaderShoulderLength { get; }
Public Shared ReadOnly Property DimLeaderShoulderLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimLeaderShoulderLength {
	ForgeTypeId^ get ();
}
static member DimLeaderShoulderLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace